Revit 2027 API
DirectShapeOptions.RoomBoundingOption Property
 Identifies whether the DirectShape supports an option for the "Room Bounding" parameter to permit participation in room boundary calculations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeRoomBoundingOption RoomBoundingOption { get; }
Public ReadOnly Property RoomBoundingOption As DirectShapeRoomBoundingOption
	Get
public:
property DirectShapeRoomBoundingOption RoomBoundingOption {
	DirectShapeRoomBoundingOption get ();
}
member RoomBoundingOption : DirectShapeRoomBoundingOption with get
Property Value
DirectShapeRoomBoundingOption
See Also
Reference
DirectShapeOptions Class
Autodesk.Revit.DB Namespace